/*******************************************************************************
 * @name    : ADC底层驱动头文件
 * @author  : 布谷鸟
 * @web     : WWW.UCORTEX.COM
 * @version : V1.2
 * @date    : 2014-04-03
 * @MDK     : KEIL MDK4.72a & KEL MDK 5.10
 * @brief   : 设置PA0为模拟输入端口，使能内部STM32内部温度传感器
 * ---------------------------------------------------------------------------- 
 * @copyright
 *
 * UCORTEX版权所有，违者必究！例程源码仅供大家参考，旨在交流学习和节省开发时间，
 * 对于因为参考本文件内容，导致您的产品直接或间接受到破坏，或涉及到法律问题，作
 * 者不承担任何责任。对于使用过程中发现的问题，如果您能在WWW.UCORTEX.COM网站反
 * 馈给我们，我们会非常感谢，并将对问题及时研究并作出改善。例程的版本更新，将不
 * 做特别通知，请您自行到WWW.UCORTEX.COM下载最新版本，谢谢。
 * 对于以上声明，UCORTEX保留进一步解释的权利！
 * ----------------------------------------------------------------------------
 * @description
 *
 * PA0 -> ADC1_CH0
 * TEMP-> ADC1_CH16
 *
 *-----------------------------------------------------------------------------
 * @history
 * ----------------------------------------------------------------------------
 * 更改时间：2014-04-06    更改人：布谷鸟
 * 版本记录：V1.0
 * 更改内容：新建
 * ----------------------------------------------------------------------------
 * 更改时间：2014-04-06    更改人：布谷鸟
 * 版本记录：V1.1
 * 更改内容：在ADC_Initialize中添加了开启STM32内部温度传感器：
 * ADC_TempSensorVrefintCmd(ENABLE); //开启内部温度传感器，不需要开启时请注释掉
 * ----------------------------------------------------------------------------
 * 更改时间：2014-04-07    更改人：布谷鸟
 * 版本记录：V1.2
 * 更改内容：添加了ADC DMA工作方式：void ADC1_DMAInitialize(void)
 * ----------------------------------------------------------------------------
 *
 ******************************************************************************/

#ifndef __ADC_H
#define __ADC_H
#include "stm32f10x.h"

//是否使用ADC DMA传输
#define 	ADC_DMA_TRANSFER		1 //如果不需要支持DMA，请定义为0

#if ADC_DMA_TRANSFER
extern __IO uint16_t ADC_Buffer[2];
#define ADC1_DR_Address    ((uint32_t)0x4001244C)//ADC1数据寄存器
#endif

#define ADC_TEMP_CH  	ADC_Channel_16 //温度传感器通道

void ADC_Initialize(void);
uint16_t Get_Adc(ADC_TypeDef* ADCx, uint8_t ch);
uint16_t Get_Adc_Average(ADC_TypeDef* ADCx, uint8_t ch);
#if ADC_DMA_TRANSFER
void ADC1_DMAInitialize(void);
#endif

#endif

/********************* (C) COPYRIGHT 2014 WWW.UCORTEX.COM **********END OF FILE**********/
