 /*******************************************************************************
 * @name    : JoyStick摇杆按键驱动头文件
 * @author  : 布谷鸟
 * @web     : WWW.UCORTEX.COM
 * @version : V1.0
 * @date    : 2014-04-03
 * @MDK     : KEIL MDK4.72a & KEL MDK 5.10
 * @brief   : 介绍一种通过模拟电压来检测按键的方法
 * ---------------------------------------------------------------------------- 
 * @copyright
 *
 * UCORTEX版权所有，违者必究！例程源码仅供大家参考，旨在交流学习和节省开发时间，
 * 对于因为参考本文件内容，导致您的产品直接或间接受到破坏，或涉及到法律问题，作
 * 者不承担任何责任。对于使用过程中发现的问题，如果您能在WWW.UCORTEX.COM网站反
 * 馈给我们，我们会非常感谢，并将对问题及时研究并作出改善。例程的版本更新，将不
 * 做特别通知，请您自行到WWW.UCORTEX.COM下载最新版本，谢谢。
 * 对于以上声明，UCORTEX保留进一步解释的权利！
 * ----------------------------------------------------------------------------
 * @description
 *
 * 本实验实现功能：
 * 按下JoyStick的不同按键（上下左右中），根据电阻分压原理，会在公共端（连接到STM32的
 * PA.00）产生不同的电压。通过检测PA.00采样到的电压值，我们就可以判断是哪个按键按下，
 * 从而实现按键扫描功能。这种方式使得我们可以通过一个GPIO，实现5个按键值的扫描。
 *
 *-----------------------------------------------------------------------------
 * @history
 * ----------------------------------------------------------------------------
 * 更改时间：2014-04-06    更改人：布谷鸟
 * 版本记录：V1.0
 * 更改内容：新建
 * ----------------------------------------------------------------------------
 *
 ******************************************************************************/
#ifndef __JOYSTICK_H
#define __JOYSTICK_H

#include "stm32f10x.h"

#define KEY_NONE			0
#define KEY_CENTER 		1
#define KEY_UP				2
#define KEY_LEFT			3
#define KEY_DOWN			4
#define KEY_RIGHT			5

void JoyStick_Init(void);//摇杆初始化
uint8_t JoyStick_Scan(uint8_t polling);  	//摇杆扫描					    
#endif

/********************* (C) COPYRIGHT 2014 WWW.UCORTEX.COM **********END OF FILE**********/
