/*******************************************************************************
 * @name    : LED控制驱动头文件
 * @author  : 布谷鸟
 * @web     : WWW.UCORTEX.COM
 * @version : V1.1
 * @date    : 2014-04-03
 * @MDK     : KEIL MDK4.72a & KEL MDK 5.10
 * @brief   : 配置STM32 PB12作为输出口，用来控制LED指示灯
 * ---------------------------------------------------------------------------- 
 * @copyright
 *
 * UCORTEX版权所有，违者必究！例程源码仅供大家参考，旨在交流学习和节省开发时间，
 * 对于因为参考本文件内容，导致您的产品直接或间接受到破坏，或涉及到法律问题，作
 * 者不承担任何责任。对于使用过程中发现的问题，如果您能在WWW.UCORTEX.COM网站反
 * 馈给我们，我们会非常感谢，并将对问题及时研究并作出改善。例程的版本更新，将不
 * 做特别通知，请您自行到WWW.UCORTEX.COM下载最新版本，谢谢。
 * 对于以上声明，UCORTEX保留进一步解释的权利！
 * ----------------------------------------------------------------------------
 * @description
 * LED -> PB12
 * ----------------------------------------------------------------------------
 * 更改时间：2014-04-03    更改人：布谷鸟
 * 版本记录：V1.0
 * 更改内容：新建
 * ----------------------------------------------------------------------------
 * 更改时间：2014-04-03    更改人：布谷鸟
 * 版本记录：V1.1
 * 更改内容：改为位带操作模式
 * ----------------------------------------------------------------------------
 *
 ******************************************************************************/

#ifndef __LED_H
#define __LED_H
#include "stm32f10x.h"
#include "bitband.h"	//使用位带操作，一定要包含此头文件

#define LED		GPIOout(GPIOB, 12)	//定义PB12位带操作

void LED_Init(void);	//LED IO初始化
void LED_On(void);		//LED亮
void LED_Off(void);		//LED灭
void LED_Toggle(void);//LED状态反转

#endif

/********************* (C) COPYRIGHT 2014 WWW.UCORTEX.COM **********END OF FILE**********/
