/*******************************************************************************
 * @name    : 定时器配置头文件
 * @author  : 布谷鸟
 * @web     : WWW.UCORTEX.COM
 * @version : V1.2
 * @date    : 2014-04-03
 * @MDK     : KEIL MDK4.72a & KEL MDK 5.10
 * @brief   : 介绍如何配置定时器和编写定时中断服务程序
 * ---------------------------------------------------------------------------- 
 * @copyright
 *
 * UCORTEX版权所有，违者必究！例程源码仅供大家参考，旨在交流学习和节省开发时间，
 * 对于因为参考本文件内容，导致您的产品直接或间接受到破坏，或涉及到法律问题，作
 * 者不承担任何责任。对于使用过程中发现的问题，如果您能在WWW.UCORTEX.COM网站反
 * 馈给我们，我们会非常感谢，并将对问题及时研究并作出改善。例程的版本更新，将不
 * 做特别通知，请您自行到WWW.UCORTEX.COM下载最新版本，谢谢。
 * 对于以上声明，UCORTEX保留进一步解释的权利！
 * ----------------------------------------------------------------------------
 * @description
 *
 *-----------------------------------------------------------------------------
 * @history
 * ----------------------------------------------------------------------------
 * 更改时间：2014-04-06    更改人：布谷鸟
 * 版本记录：V1.0
 * 更改内容：新建
 * ----------------------------------------------------------------------------
 * 更改时间：2014-05-02    更改人：布谷鸟
 * 版本记录：V1.1
 * 更改内容：添加TIM4_CH3 PWM输出配置
 * ----------------------------------------------------------------------------
 * 更改时间：2014-05-02    更改人：布谷鸟
 * 版本记录：V1.2
 * 更改内容：添加TIM2_CH1输入捕获配置
 * ----------------------------------------------------------------------------
 *
 ******************************************************************************/

#ifndef __TIMER_H
#define __TIMER_H
#include "stm32f10x.h"
#include "delay.h"

//CaptureStatus : Bit15 - 完成捕获标志
//                Bit14 - 捕捉到上升沿标志
//                Bit13 - 溢出错误标志
//                Bit12 - 保留位
//                Bit11..0 - 更新事件发生次数
extern __IO uint16_t CaptureStatus;
extern __IO uint16_t CaptureValue1;//上升沿时的捕获值
extern __IO uint16_t CaptureValue2;//下降沿时的捕获值


void Timer1_Init(uint16_t arr, uint16_t psc);						//timer1定时器中断初始化
void TIM4_CH1_PWM_Init(u16 arr,u16 psc);								//红外发射初始化
void SendData2(u8 SysNum, u8 KeyNum);										//红外发射
 
#endif

/********************* (C) COPYRIGHT 2014 WWW.UCORTEX.COM **********END OF FILE**********/
