/*******************************************************************************
 * @name    : MPU6050驱动
 * @author  : 布谷鸟
 * @web     : WWW.UCORTEX.COM
 * @version : V1.0
 * @date    : 2014-04-03
 * @MDK     : KEIL MDK4.72a & KEL MDK 5.10
 * @brief   : 实现MPU5050的配置与操作
 * ---------------------------------------------------------------------------- 
 * @copyright
 *
 * UCORTEX版权所有，违者必究！例程源码仅供大家参考，旨在交流学习和节省开发时间，
 * 对于因为参考本文件内容，导致您的产品直接或间接受到破坏，或涉及到法律问题，作
 * 者不承担任何责任。对于使用过程中发现的问题，如果您能在WWW.UCORTEX.COM网站反
 * 馈给我们，我们会非常感谢，并将对问题及时研究并作出改善。例程的版本更新，将不
 * 做特别通知，请您自行到WWW.UCORTEX.COM下载最新版本，谢谢。
 * 对于以上声明，UCORTEX保留进一步解释的权利！
 * ----------------------------------------------------------------------------
 * @description
 * MPU6050是实用性非常强的6轴运动传感器，V1.0版驱动文件只是简单的实现对MPU6050设
 * 备ID的读取，用于验证I2C通信是否正常。更全面的MPU6050驱动，请参考下一版本。
 *-----------------------------------------------------------------------------
 * @history
 * ----------------------------------------------------------------------------
 * 更改时间：2014-04-06    更改人：布谷鸟
 * 版本记录：V1.0
 * 更改内容：新建
 * ----------------------------------------------------------------------------
 *
 ******************************************************************************/
#include "mpu6050.h"

/**
  * @brief 读取MPU6050设备ID
  * @param None
  * @retval 读取到的设备ID号:0x68
  * @note
	* 	MPU6050设备地址是:0xD0，设备ID寄存器地址是: 0x75，设备ID值是0x68
	*		如果I2C读取到的值是0x68，说明与MPU6050的I2C连接正常
  */
uint8_t MPU6050_getDeviceID(void)
{
	uint8_t data;
	
	I2C_ReadOneByte(MPU6050_DevAddr, MPU6050_WHO_AM_I, &data);
	return data;
}


/********************* (C) COPYRIGHT 2014 WWW.UCORTEX.COM **********END OF FILE**********/
