/*******************************************************************************
 * @name    : 蜂鸣器PWM控制驱动头文件
 * @author  : 布谷鸟
 * @web     : WWW.UCORTEX.COM
 * @version : V1.1
 * @date    : 2014-04-03
 * @MDK     : KEIL MDK4.72a & KEL MDK 5.10
 * @brief   : 将PB8配置为PWM输出，用于控制蜂鸣器
 * ---------------------------------------------------------------------------- 
 * @copyright
 *
 * UCORTEX版权所有，违者必究！例程源码仅供大家参考，旨在交流学习和节省开发时间，
 * 对于因为参考本文件内容，导致您的产品直接或间接受到破坏，或涉及到法律问题，作
 * 者不承担任何责任。对于使用过程中发现的问题，如果您能在WWW.UCORTEX.COM网站反
 * 馈给我们，我们会非常感谢，并将对问题及时研究并作出改善。例程的版本更新，将不
 * 做特别通知，请您自行到WWW.UCORTEX.COM下载最新版本，谢谢。
 * 对于以上声明，UCORTEX保留进一步解释的权利！
 * ----------------------------------------------------------------------------
 * @description
 * TIM4_CH3 -> PB8 控制蜂鸣器
 *
 *-----------------------------------------------------------------------------
 * @history
 * ----------------------------------------------------------------------------
 * 更改时间：2014-04-03    更改人：布谷鸟
 * 版本记录：V1.0
 * 更改内容：新建
 * ----------------------------------------------------------------------------
 * 更改时间：2014-04-03    更改人：布谷鸟
 * 版本记录：V1.1
 * 更改内容：改为位带操作模式
 * ----------------------------------------------------------------------------
 *
 ******************************************************************************/
#ifndef __BEEP_H
#define __BEEP_H
#include "stm32f10x.h"

//频率(freq) = 72000000/((1+psc)*(arr+1)) = 18000/36000=500Hz
//占空比(duty)= (compare+1)/(arr+1) = 18000/36000 = 50%
extern uint16_t beep_arr;			//蜂鸣器pwm的重载值
extern uint16_t beep_psc;		//蜂鸣器pwm的预分频值
extern uint16_t beep_compare;//蜂鸣器pwm的比较值（决定占空比）

void BEEP_Init(void);
void BEEP_Off(void);
void BEEP_On(void);
void BEEP_SetFreq(uint16_t freq);
uint16_t BEEP_GetFreq(void);
void BEEP_SetDuty(uint8_t duty);
uint8_t BEEP_GetDuty(void);
#endif

/********************* (C) COPYRIGHT 2014 WWW.UCORTEX.COM **********END OF FILE**********/


