/*******************************************************************************
 * @name    : 系统待机唤醒
 * @author  : 布谷鸟
 * @web     : WWW.UCORTEX.COM
 * @version : V1.0
 * @date    : 2014-04-03
 * @MDK     : KEIL MDK4.72a & KEL MDK 5.10
 * @brief   : 介绍STM32进入待机(standby)状态和从standby唤醒的方法
 * ---------------------------------------------------------------------------- 
 * @copyright
 *
 * UCORTEX版权所有，违者必究！例程源码仅供大家参考，旨在交流学习和节省开发时间，
 * 对于因为参考本文件内容，导致您的产品直接或间接受到破坏，或涉及到法律问题，作
 * 者不承担任何责任。对于使用过程中发现的问题，如果您能在WWW.UCORTEX.COM网站反
 * 馈给我们，我们会非常感谢，并将对问题及时研究并作出改善。例程的版本更新，将不
 * 做特别通知，请您自行到WWW.UCORTEX.COM下载最新版本，谢谢。
 * 对于以上声明，UCORTEX保留进一步解释的权利！
 * ----------------------------------------------------------------------------
 * @description
 * 调用SYS_STANDBY()使系统进入待机状态。
 *
 * 注意:
 * 1) 进入待机前先要配置PA0(WKUP)为外部中断输入，并编写中断服务程序。
 * 2) 进入待机前使能唤醒管脚：PWR_WakeUpPinCmd(ENABLE);  //使能唤醒管脚功能
 *-----------------------------------------------------------------------------
 * @history
 * ----------------------------------------------------------------------------
 * 更改时间：2014-04-03    更改人：布谷鸟
 * 版本记录：V1.0
 * 更改内容：新建
 * ----------------------------------------------------------------------------
 *
 ******************************************************************************/
#include "standby.h"

/**
  * @brief  系统进入待机模式
  * @param  None
  * @retval None
	* @note   可以通过WKUP引脚上升沿、RTC闹钟事件、NRST复位引脚、IWDG复位来唤醒系统
  */
void SYS_STANDBY(void)
{
	RCC_APB2PeriphResetCmd(0X01FC,DISABLE);	//将所有IO口复位成浮空输入
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);	//使能PWR外设时钟
	PWR_WakeUpPinCmd(ENABLE);  //使能唤醒管脚功能
	PWR_EnterSTANDBYMode();	  //进入待命（STANDBY）模式 		 
}


/********************* (C) COPYRIGHT 2014 WWW.UCORTEX.COM **********END OF FILE**********/
